
class Urls:
    QA_SCOOTER = 'https://qa-scooter.praktikum-services.ru/'
    REDIRECT_DZEN = 'https://dzen.ru/?yredirect=true&is_autologin_ya=true'

class MainPageAnswerToQuestion:
    FISRT_QUESTION_ANSWER = "Сутки — 400 рублей. Оплата курьеру — наличными или картой."
    SECOND_QUESTION_ANSWER = "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим."
    THIRD_QUESTION_ANSWER = "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30."
    FOURTH_QUESTION_ANSWER = 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.'
    FIFTH_QUESTION_ANSWER = 'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.'
    SIXTH_QUESTION_ANSWER = 'Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.'
    SEVENTH_QUESTION_ANSWER = 'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.'
    EIGTH_QUESTION_ANSWER = 'Да, обязательно. Всем самокатов! И Москве, и Московской области.'

class ClientData1:
    NAME1 = 'Егор'
    SURNAME1 = 'Федорчук'
    ADDRESS1 = 'Москва, ул. Петушковская набержная. д. 4'
    PHONE1 = '+79997775566'
    COMMENT1 = 'Принимать буду только с полным заправленым бензобаком'

class ClientData2:
    NAME2 = 'Иван'
    SURNAME2 = 'Тыщпичуг'
    ADDRESS2 = 'Москва, ул. Выдуманная площадь. д. 27'
    PHONE2 = '+79989875132'
    COMMENT2 = 'Просьба звонить за час'